In [6]:
import pandas as pd
# read the csv files
fd_aapl = pd.read_csv('../data/yfinance/AAPL.csv')
fd_amzn = pd.read_csv("../data/yfinance/AMZN.csv")
fd_goog = pd.read_csv("../data/yfinance/GOOG.csv")
fd_meta = pd.read_csv("../data/yfinance/META.csv")
fd_msft = pd.read_csv("../data/yfinance/MSFT.csv")
fd_nvda = pd.read_csv("../data/yfinance/NVDA.csv")
display(fd_aapl.head())
display(fd_amzn.head())
display(fd_goog.head())
display(fd_meta.head())
display(fd_msft.head())
display(fd_nvda.head())

         Date     Close      High       Low      Open      Volume
0  2009-01-02  2.721686  2.730385  2.554037  2.575630   746015200
1  2009-01-05  2.836553  2.884539  2.780469  2.794266  1181608400
2  2009-01-06  2.789767  2.914229  2.770872  2.877641  1289310400
3  2009-01-07  2.729484  2.774170  2.706990  2.753477   753048800
4  2009-01-08  2.780169  2.793666  2.700393  2.712090   673500800

         Date  Close    High     Low    Open     Volume
0  2009-01-02  2.718  2.7265  2.5535  2.5675  145928000
1  2009-01-05  2.703  2.7870  2.6515  2.7865  190196000
2  2009-01-06  2.868  2.9110  2.6875  2.7275  221602000
3  2009-01-07  2.810  2.8475  2.7675  2.8145  158854000
4  2009-01-08  2.858  2.8660  2.7290  2.7495  131558000

         Date     Close      High       Low      Open     Volume
0  2009-01-02  7.948608  7.960977  7.557264  7.633949  144961322
1  2009-01-05  8.115089  8.194003  7.792268  7.940692  196293007
2  2009-01-06  8.263762  8.430492  8.074027  8.237046  257971329
3  2009-01-07  7.965677  8.185839  7.885034  8.121770  180453860
4  2009-01-08  8.044340  8.044340  7.850152  7.873406  144567852

         Date      Close       High        Low       Open     Volume
0  2012-05-18  37.995762  44.724282  37.767172  41.792356  573576400
1  2012-05-21  33.821495  36.435382  32.797807  36.306177  168192700
2  2012-05-22  30.810066  33.384198  30.750434  32.410203  101786600
3  2012-05-23  31.803938  32.300874  31.167860  31.177799   73600000
4  2012-05-24  32.827625  33.006523  31.575347  32.748117   50237200

         Date      Close       High        Low       Open    Volume
0  2009-01-02  14.872976  14.924187  14.170662  14.287715  50084000
1  2009-01-05  15.011971  15.121707  14.675444  14.777866  61475200
2  2009-01-06  15.187551  15.363130  15.077815  15.180236  58083400
3  2009-01-07  14.273087  14.843718  14.251139  14.770560  72709900
4  2009-01-08  14.719351  14.770561  14.302350  14.360876  70255400

         Date     Close      High       Low      Open      Volume
0  2009-01-02  0.199652  0.201027  0.184294  0.184982   497124000
1  2009-01-05  0.203319  0.207904  0.195984  0.197360   705736000
2  2009-01-06  0.210196  0.216156  0.204695  0.209279   657904000
3  2009-01-07  0.197589  0.205382  0.190483  0.205382   870096000
4  2009-01-08  0.192546  0.195067  0.180626  0.195067  1014496000

In [7]:
fd_aapl = fd_aapl.sort_values("Date")
fd_aapl = fd_aapl.set_index("Date")
fd_amzn = fd_amzn.sort_values("Date")
fd_amzn = fd_amzn.set_index("Date")
fd_goog = fd_goog.sort_values("Date")
fd_goog = fd_goog.set_index("Date")
fd_meta = fd_meta.sort_values("Date")
fd_meta = fd_meta.set_index("Date")
fd_msft = fd_msft.sort_values("Date")
fd_msft = fd_msft.set_index("Date")
fd_nvda = fd_nvda.sort_values("Date")
fd_nvda = fd_nvda.set_index("Date")

display(fd_aapl.head())
display(fd_amzn.head())
display(fd_goog.head())
display(fd_meta.head())
display(fd_msft.head())
display(fd_nvda.head())

               Close      High       Low      Open      Volume
Date
2009-01-02  2.721686  2.730385  2.554037  2.575630   746015200
2009-01-05  2.836553  2.884539  2.780469  2.794266  1181608400
2009-01-06  2.789767  2.914229  2.770872  2.877641  1289310400
2009-01-07  2.729484  2.774170  2.706990  2.753477   753048800
2009-01-08  2.780169  2.793666  2.700393  2.712090   673500800

            Close    High     Low    Open     Volume
Date
2009-01-02  2.718  2.7265  2.5535  2.5675  145928000
2009-01-05  2.703  2.7870  2.6515  2.7865  190196000
2009-01-06  2.868  2.9110  2.6875  2.7275  221602000
2009-01-07  2.810  2.8475  2.7675  2.8145  158854000
2009-01-08  2.858  2.8660  2.7290  2.7495  131558000

               Close      High       Low      Open     Volume
Date
2009-01-02  7.948608  7.960977  7.557264  7.633949  144961322
2009-01-05  8.115089  8.194003  7.792268  7.940692  196293007
2009-01-06  8.263762  8.430492  8.074027  8.237046  257971329
2009-01-07  7.965677  8.185839  7.885034  8.121770  180453860
2009-01-08  8.044340  8.044340  7.850152  7.873406  144567852

                Close       High        Low       Open     Volume
Date
2012-05-18  37.995762  44.724282  37.767172  41.792356  573576400
2012-05-21  33.821495  36.435382  32.797807  36.306177  168192700
2012-05-22  30.810066  33.384198  30.750434  32.410203  101786600
2012-05-23  31.803938  32.300874  31.167860  31.177799   73600000
2012-05-24  32.827625  33.006523  31.575347  32.748117   50237200

                Close       High        Low       Open    Volume
Date
2009-01-02  14.872976  14.924187  14.170662  14.287715  50084000
2009-01-05  15.011971  15.121707  14.675444  14.777866  61475200
2009-01-06  15.187551  15.363130  15.077815  15.180236  58083400
2009-01-07  14.273087  14.843718  14.251139  14.770560  72709900
2009-01-08  14.719351  14.770561  14.302350  14.360876  70255400

               Close      High       Low      Open      Volume
Date
2009-01-02  0.199652  0.201027  0.184294  0.184982   497124000
2009-01-05  0.203319  0.207904  0.195984  0.197360   705736000
2009-01-06  0.210196  0.216156  0.204695  0.209279   657904000
2009-01-07  0.197589  0.205382  0.190483  0.205382   870096000
2009-01-08  0.192546  0.195067  0.180626  0.195067  1014496000

In [9]:
# calculate for each stock
import talib as ta
# Simple Moving Average (SMA)
fd_aapl["SMA_20"] = ta.SMA(fd_aapl["Close"], timeperiod=20)
fd_amzn["SMA_20"] = ta.SMA(fd_amzn["Close"], timeperiod=20)
fd_goog["SMA_20"] = ta.SMA(fd_goog["Close"], timeperiod=20)
fd_meta["SMA_20"] = ta.SMA(fd_meta["Close"], timeperiod=20)
fd_msft["SMA_20"] = ta.SMA(fd_msft["Close"], timeperiod=20)
fd_nvda["SMA_20"] = ta.SMA(fd_nvda["Close"], timeperiod=20)
#  Relative Strength Index (RSI)
fd_aapl["RSI_14"] = ta.RSI(fd_aapl["Close"], timeperiod=14)
fd_amzn["RSI_14"] = ta.RSI(fd_amzn["Close"], timeperiod=14)
fd_goog["RSI_14"] = ta.RSI(fd_goog["Close"], timeperiod=14)
fd_meta["RSI_14"] = ta.RSI(fd_meta["Close"], timeperiod=14)
fd_msft["RSI_14"] = ta.RSI(fd_msft["Close"], timeperiod=14)
fd_nvda["RSI_14"] = ta.RSI(fd_nvda["Close"], timeperiod=14)
# Moving Average Convergence Divergence (MACD)
fd_aapl["MACD"], fd_aapl["MACD_Signal"], fd_aapl["MACD_Hist"] = ta.MACD(fd_aapl["Close"], fastperiod=12, slowperiod=26, signalperiod=9)
fd_amzn["MACD"], fd_amzn["MACD_Signal"], fd_amzn["MACD_Hist"] = ta.MACD(fd_amzn["Close"], fastperiod=12, slowperiod=26, signalperiod=9)
fd_goog["MACD"], fd_goog["MACD_Signal"], fd_goog["MACD_Hist"] = ta.MACD(fd_goog["Close"], fastperiod=12, slowperiod=26, signalperiod=9)
fd_meta["MACD"], fd_meta["MACD_Signal"], fd_meta["MACD_Hist"] = ta.MACD(fd_meta["Close"], fastperiod=12, slowperiod=26, signalperiod=9)
fd_msft["MACD"], fd_msft["MACD_Signal"], fd_msft["MACD_Hist"] = ta.MACD(fd_msft["Close"], fastperiod=12, slowperiod=26, signalperiod=9)
fd_nvda["MACD"], fd_nvda["MACD_Signal"], fd_nvda["MACD_Hist"] = ta.MACD(fd_nvda["Close"], fastperiod=12, slowperiod=26, signalperiod=9)

display(fd_aapl.head())
display(fd_amzn.head())
display(fd_goog.head())
display(fd_meta.head())
display(fd_msft.head())
display(fd_nvda.head())

,Close,High,Low,Open,Volume,SMA_20,RSI_14,MACD,MACD_Signal,MACD_Hist
Date,,,,,,,,,,
2009-01-02,2.721686,2.730385,2.554037,2.575630,746015200,NaN,NaN,NaN,NaN,NaN
2009-01-05,2.836553,2.884539,2.780469,2.794266,1181608400,NaN,NaN,NaN,NaN,NaN
2009-01-06,2.789767,2.914229,2.770872,2.877641,1289310400,NaN,NaN,NaN,NaN,NaN
2009-01-07,2.729484,2.774170,2.706990,2.753477,753048800,NaN,NaN,NaN,NaN,NaN
2009-01-08,2.780169,2.793666,2.700393,2.712090,673500800,NaN,NaN,NaN,NaN,NaN

,Close,High,Low,Open,Volume,SMA_20,RSI_14,MACD,MACD_Signal,MACD_Hist
Date,,,,,,,,,,
2009-01-02,2.718,2.7265,2.5535,2.5675,145928000,NaN,NaN,NaN,NaN,NaN
2009-01-05,2.703,2.7870,2.6515,2.7865,190196000,NaN,NaN,NaN,NaN,NaN
2009-01-06,2.868,2.9110,2.6875,2.7275,221602000,NaN,NaN,NaN,NaN,NaN
2009-01-07,2.810,2.8475,2.7675,2.8145,158854000,NaN,NaN,NaN,NaN,NaN
2009-01-08,2.858,2.8660,2.7290,2.7495,131558000,NaN,NaN,NaN,NaN,NaN

,Close,High,Low,Open,Volume,SMA_20,RSI_14,MACD,MACD_Signal,MACD_Hist
Date,,,,,,,,,,
2009-01-02,7.948608,7.960977,7.557264,7.633949,144961322,NaN,NaN,NaN,NaN,NaN
2009-01-05,8.115089,8.194003,7.792268,7.940692,196293007,NaN,NaN,NaN,NaN,NaN
2009-01-06,8.263762,8.430492,8.074027,8.237046,257971329,NaN,NaN,NaN,NaN,NaN
2009-01-07,7.965677,8.185839,7.885034,8.121770,180453860,NaN,NaN,NaN,NaN,NaN
2009-01-08,8.044340,8.044340,7.850152,7.873406,144567852,NaN,NaN,NaN,NaN,NaN

,Close,High,Low,Open,Volume,SMA_20,RSI_14,MACD,MACD_Signal,MACD_Hist
Date,,,,,,,,,,
2012-05-18,37.995762,44.724282,37.767172,41.792356,573576400,NaN,NaN,NaN,NaN,NaN
2012-05-21,33.821495,36.435382,32.797807,36.306177,168192700,NaN,NaN,NaN,NaN,NaN
2012-05-22,30.810066,33.384198,30.750434,32.410203,101786600,NaN,NaN,NaN,NaN,NaN
2012-05-23,31.803938,32.300874,31.167860,31.177799,73600000,NaN,NaN,NaN,NaN,NaN
2012-05-24,32.827625,33.006523,31.575347,32.748117,50237200,NaN,NaN,NaN,NaN,NaN

,Close,High,Low,Open,Volume,SMA_20,RSI_14,MACD,MACD_Signal,MACD_Hist
Date,,,,,,,,,,
2009-01-02,14.872976,14.924187,14.170662,14.287715,50084000,NaN,NaN,NaN,NaN,NaN
2009-01-05,15.011971,15.121707,14.675444,14.777866,61475200,NaN,NaN,NaN,NaN,NaN
2009-01-06,15.187551,15.363130,15.077815,15.180236,58083400,NaN,NaN,NaN,NaN,NaN
2009-01-07,14.273087,14.843718,14.251139,14.770560,72709900,NaN,NaN,NaN,NaN,NaN
2009-01-08,14.719351,14.770561,14.302350,14.360876,70255400,NaN,NaN,NaN,NaN,NaN

,Close,High,Low,Open,Volume,SMA_20,RSI_14,MACD,MACD_Signal,MACD_Hist
Date,,,,,,,,,,
2009-01-02,0.199652,0.201027,0.184294,0.184982,497124000,NaN,NaN,NaN,NaN,NaN
2009-01-05,0.203319,0.207904,0.195984,0.197360,705736000,NaN,NaN,NaN,NaN,NaN
2009-01-06,0.210196,0.216156,0.204695,0.209279,657904000,NaN,NaN,NaN,NaN,NaN
2009-01-07,0.197589,0.205382,0.190483,0.205382,870096000,NaN,NaN,NaN,NaN,NaN
2009-01-08,0.192546,0.195067,0.180626,0.195067,1014496000,NaN,NaN,NaN,NaN,NaN